[
    {
        "id": "development-update-6",
    
        "title": "Development underway for 2022.08.01 + Utility updates",
    
        "date": "July 20th, 2022 ",
    
        "paragraph": "The Rolling Rhino Remix development team has begun development on 2022.08.01 which will see small-scale changes. The largest change is the deprecation of <span class='code'>rhino-init</span>, with all required directories and files being created on disk image generation. 2022.08.01 will also see the upgrades of packages and kernel version.",
        
        "sections": [
            {
                "title": "rhino-update v1.6 + rhino-config v3.1.0",
    
                "paragraph": "<span class='code'>rhino-update</span> has seen many small-scale changes accumulate over-time through development pull requests, so they've now been compiled into a tagged release."
            },
            {
                "title": "What's new?",
    
                "paragraph": "• Use type -P to check if flatpak and snap are installed.<br>• Fix typo in the .deb URL<br>• Updated kernel to 5.18.12<br>• Add support for installing even more kernels.<br><br><span class='code'>rhino-config</span> saw the upgrades of dependencies as well as the ability to add more kernels, which is then handled via <span class='code'>rhino-update</span>.<br><br>To receive the latest upgrades to your system, please run <span class='code'>rhino-update</span>."
            }
        ]
    },
    {
        "id": "2022-07-01",
    
        "title": "Release 2022.07.01",
    
        "date": "Unrecorded Date",
    
        "paragraph": "It's been over a month since the last disk image release of Rolling Rhino Remix has released. We recently shifted our release model to just compile the latest updates to the distribution and release them in monthly disk images. This change was necessary as Rolling Rhino Remix reached a natural stagnation in its development where core distribution features were not required to be developed anymore.",
        
        "sections": [
            {
                "title": "What's new?",
    
                "paragraph": "• Rolling Rhino Remix 2022.07.01 is the first disk image to have the latest Linux kernel packaged and pre-compiled for the distribution. Linux kernel 5.18.8 is now included by default.<br>• The latest releases for our <span class='code'>rhino-config</span> and <span class='code'>rhino-deinst</span> utility have been packaged in this monthly disk image release.<br>• Nala has now been included in the distribution by default. Nala is a libapt-pkg front-end which has amazing features such as Parallel downloads, better output formatting, transaction history and more.<br><br>If you are using an already existing installation of Rolling Rhino Remix then you will be able to upgrade to the latest version with <span class='code'>rhino-update</span> if you do not have these changes already.<br><br>If you wish to download Rolling Rhino Remix with a fresh disk image then you can download it <a href='/download'>here</a>.<br><br>This version of Rolling Rhino Remix was released two days later than expected. The reason for this was due to time constraints in our personal lives such as College, School and Work. One major bug presented itself in our testing stage on the 30th of June and so we had to fix that as well. We apologise for the late release of this disk image."
            }
        ]
    },
    {
        "id": "rhino-update-150",
    
        "title": "rhino-update v1.5 - Nala integration",
    
        "date": "Unrecorded Date",
    
        "paragraph": "The Rolling Rhino Remix project has worked closely with the lead developer of the <a href='https://gitlab.com/volian/nala' target='_blank'>Nala</a> project, Volitank.<br>We have partnered up with them to bring Nala to the distribution and utilise it within <span class='code'>rhino-update</span>.<br><br>Nala is a front-end for <span class='code'>libapt-pkg</span>. It has many great features that make it a great alternative to utilising the apt command itself, while keeping the same core functionality of downloading and installing .deb packaged from repositories. Especially for newer users it can be hard to understand what apt is trying to do when installing or upgrading. Outside of pretty formatting, the number 1 reason to use Nala over apt is parallel downloads. Nala is much faster at apt when it comes to updating repositories as well as installing or upgrading packages. The formatting makes it much more human readable.<br><br>So, how was it integrated? Rolling Rhino Remix now has Nala preinstalled on all systems once an update has occured. The next disk image release, 2022.07.01, will also contain the Nala package preinstalled. It is recommended to install and remove packages via Nala instead of apt now. To update your packages, it is still recommended to utilise <span class='code'>rhino-update</span>, which will now use Nala for package upgrades.",
        
        "sections": [
        ]
    },
    {
        "id": "rhino-config-v300",
    
        "title": "rhino-config v3.0 & rhino-update v1.4 released!",
    
        "date": "Unrecorded Date",
    
        "paragraph": "The development team has been hard at work for two big updates to Rolling Rhino Remix utilities, as <span class='code'>rhino-config</span> gets the long awaited update that allows for you to switch to alternate Linux-based Kernels such as xanmod and liquorix. Our update utility, <span class='code'>rhino-update</span> also receives many quality of life changes.",
        
        "sections": [
            {
                "title": "rhino-config v3.0",
    
                "paragraph": "<b>What's changed?</b><br><br>• The mainline flag has been removed from rhino-config, with the latest Linux kernel, delivered straight from the Ubuntu mainline repositories, being installed by default on an update.<br>• A new sub-command, <span class='code'>rhino-config switch-kernel</span>, allows for the ability to switch to an alternate Linux kernel.<br><br>It is recommended you read the <a href='https://github.com/rollingrhinoremix/docs/wiki/rhino-config' target='_blank'>rhino-config Wiki page</a> so you have information on how to utilise the new sub-commands.<br>• It is important to note that the Wiki may take a short while to be updated."
            },
            {
                "title": "rhino-update v1.4",
    
                "paragraph": "<b>What's changed?</b><br><br>• If Flatpak is installed on the system, Flatpak applications will be updated automatically via <span class='code'>rhino-update</span>.<br>• A bug fix to not update Pacstall as root has been applied.<br>• A minor change to use the latest tagged release automatically for rhino utilities.<br>• A bug fix to not rely on rhino-config configuration files to check if snapd is installed to handle Snap application updates.<br>• System files such as /etc/os-release are updated by rhino-update. Standards are also now adhered to.<br>• The ability to install alternate kernels has been provided. This feature runs in parallel to <span class='code'>rhino-config</span> v3.0.<br>• Kernel files are now downloaded simultaneously, which will make upgrade times significantly faster.<br><br>The majority of these changes happened in incremental steps, and users will have received most of these changes already, but they are now compiled into one release.<br><br>Nevertheless, some new features such as <span class='code'>rhino-config v3.0</span>, the ability to install alternate kernels, as well as simultaneously downloading kernel files have just been released. To receive the latest upgrades to your system, please run <span class='code'>rhino-update</span>."
            }
        ]
    },
    {
        "id": "development-update-5",
    
        "title": "Development underway for 2022.07.01 + New updates coming soon",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Development has begun for the release of our next disk image, which will now be released on July 1st. With most of the necessary major changes happening to the distribution, the release of new disk images will focus more on polishing and refining the user experience from out of the box, as well as compiling the latest changes provided by our team and within the Ubuntu repositories. The big change to note for this release will be that the latest Linux kernel, straight from the Ubuntu mainline PPA, will be used as the default Linux kernel from now on, rather than the default Ubuntu kernel, which can sometimes lag behind in versions. As a result of this, the mainline option is being removed in <span class='code'>rhino-config</span>.",
        
        "sections": [
            {
                "title": "Utility updates",
    
                "paragraph": "<span class='code'>rhino-config</span> is getting a refresh with v3.0.0 which is set to release soon. This version will see the aforementioned removal of the mainline flag being removed from the utility. New changes will also include a brand new subcommand called switch-kernel, which will allow you to choose alternate Linux kernels to utilise such as the xanmod and liquorix kernel.<br><br><span class='code'>rhino-deinst</span> has seen various pull requests, which will be compiled into the next release. These changes are relatively minor, with some reorganisation and bug fixes for LXDE."
            },
            {
                "title": "Website updates",
    
                "paragraph": "The website is going to get a bold new look, with our former rhino-update maintainer, Billy G, taking over the website development. The website will now feature a more modern look inspired by <a href='https://www.gnome.org/' target='_blank'>gnome.org</a>, and will now utilise a dark mode colour pallete."
            }
        ]
    },
    {
        "id": "2022-05-28",
    
        "title": "Release 2022.05.28 + more",
    
        "date": "Unrecorded Date",
    
        "paragraph": "After over three weeks of development we are proud to release 2022.05.28. This release has been our most ambitious release yet, with the launch of a brand-new utility, a minimal installation mode and more new features.",
        
        "sections": [
            {
                "title": "What's new?",
    
                "paragraph": "• New minimal installation option is available in the Ubuntu Ubiquity Installer.<br>• Our new utility, <span class='code'>rhino-deinst</span>, which installs Desktop Environments and Window Managers easily through a Terminal User Interface has been included in the distribution by default.<br>• Our disk images are now built with our brand new <span class='code'>RRR-builder</span> build system. This uses ZSTD compression which saves space.<br>• Our brand-new wallpapers have been included into the system by default. These wallpapers will automatically change between light and dark depending on whether you have set your system to use light or dark mode.<br>• In addition, these wallpapers can be selected from gnome control center or the settings app. The background will change depending on if dark mode is enabled.<br><br>Originally our minimal installation option was planned to be a seperate disk image, however we decided through its development that it would be best to include it in the standard Rolling Rhino Remix disk image, and modify Ubiquity's currently existing Minimal installation option to provide a minimalistic setup with no preinstalled Desktop Environment or extra packages.<br><br>If you are using an already existing installation of Rolling Rhino Remix then you will be able to upgrade to the latest version with <span class='code'>rhino-update</span>.<br><br>If you wish to download Rolling Rhino Remix with a fresh disk image then you can download it <a href='/download' target='_blank'>here</a>."
            },
            {
                "title": "Documentation has been ported to our GitHub Wiki",
    
                "paragraph": "We have deccided that the best way to provide adequate documentation is through a community maintained Wiki. We have utilities GitHub's Wiki feature for this reason. All documentation has been ported to the GitHub Wiki and we will be utilising the Wiki for documentation from now on. The documentation page on our website has been removed and our menu now links to the Wiki instead."
            },
            {
                "title": "New release cycle",
    
                "paragraph": "Our new release cycle sees Rolling Rhino Remix releasing monthly disk images instead. These disk images will see relatively little feature change, however they will compile the latest package updates as well as the latest updates from our utilities and new utilities if they are created. The next disk image release will occur on the 1st July 2022."
            }
        ]
    },
    {
        "id": "development-update-4",
    
        "title": "Why we are delaying the release of our next disk image",
    
        "date": "Unrecorded Date",
    
        "paragraph": "We are sorry to announce but our next disk image will not release on 2022.05.21 as initially planned, instead it will recieve an additional 7 days of development and release on the 28th of May instead. The reason for this additional time is for a few reasons:<br><br>• We are now going to be providing Rolling Rhino Remix with a minimal disk image, this disk image will be based on the daily builds of Ubuntu server, and will provide users with a more Arch Linux style install, with only the base packages they will require for their system.<br>• We have a brand-new build system, known as <span class='code'>RRR-builder</span> which generates disk images. This is a departure from Cubic, which was our previous method of disk image creation. We would like the time to adequately test and fix issues in this brand new disk image builder.<br>• We have a brand new Rhino utility in the works that was designed specifically designed for Rolling Rhino Remix minimal. It will be known as <span class='code'>rhino-deinst</span> and is a Terminal User Interface desktop environment installer. It will be installed and usable on both minimal and full-desktop Rolling Rhino Remix.<br>• The disk image size has been reduced because of ZSTD compression.",
        
        "sections": [
            {
                "title": "What will happen to Rolling Rhino Remix from now then?",
    
                "paragraph": "Not much will change. Users who still wish to have the Ubuntu-desktop preinstalled by default can use our <q>Rolling Rhino Remix - Full Desktop</q> disk image. This will provide them with the exact same experience that Rolling Rhino Remix currently has. Users who wish to use the Minimal disk image will have a slightly more difficult installation, however a system with no pre-installed desktop environment or extra packages. This is especially good for perfectionists who like to have full control over their system. Users who utilise our minimal disk image can use our new utility, <span class='code'>rhino-deinst</span>, to easily install a desktop environment."
            }
        ]
    },
    {
        "id": "development-update-3",
    
        "title": "Development underway for 2022.05.21 & Rhino utilities.",
    
        "date": "Unrecorded Date",
    
        "paragraph": "This will be an interesting release as the disk image release will sync up to the updates released on our Rhino utilites. Below we will list the changes that are coming to Rolling Rhino Remix and our utilities.",
        
        "sections": [
            {
                "title": "Release 2022.05.21:",
    
                "paragraph": "Development has begun on the next release. The development team have taken feedback from users and contributors to see what features users will want the most. Rolling Rhino Remix will now begin to include the latest Linux kernel by default. The mainline Linux kernel has a list of benefits and drawbacks. By default the mainline Linux kernel does not provide ZFS support, however the disk image will now also come packaged with zfs-dkms to provide the support for this. Users who already have Rolling Rhino Remix installed will have it installed on a system upgrade. The most exciting change in this release will be our brand-new wallpapers, which will provide a nicer splash of colour to the desktop and will integrate better with our new brand identity. The two new wallpapers automatically change between light and dark whenever you change your desktop theme between light and dark mode. To get a sneak peak at the new wallpapers, you can go view them on our <a href='/branding' target='_blank'>branding page</a>."
            },
            {
                "title": "Updates to our rhino utilities:",
    
                "paragraph": "Both of our Rhino utilities will get some big updates in this release cycle. Our rhino-update utility will now automatically install the latest Linux kernel, have the ability to verify Linux kernel checksums and recieve some code cleanup. Our configuration utility, <span class='code'>rhino-config</span>, will no longer have the option to support the mainline Linux kernel due to it being installed by default on all systems.<br><br>• If users would prefer to utilise the Ubuntu kernel as opposed to the mainline Linux kernel, they are able to select it in the GRUB boot menu on system startup."
            }
        ]
    },
    {
        "id": "branding",
    
        "title": "Changes to our brand",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Rhino Remix has gone through a major brand redesign before the next release. This includes brand new logos, new wallpapers and a brand-new website.<br><br>We believe that a good brand is essential for any project. Logos should be instantly recognizable and visible when small, and websites should be unique and readable. We have undergone major design changes to bring the best possible experience to Rolling Rhino Remix. Everything evolves, and Rolling Rhino Remix is no different, going through three website and brand design changes since the beginning of the project, however we have now created a brand identity which we believe encapsulates what Rolling Rhino Remix is about, while being unique and sticking to our Ubuntu roots.<br><br>We have now established a set of brand guidelines which you can view <a href='/branding' target='_blank'>here</a>. Our set of Brand Guidelines exist so that Rolling Rhino Remix is communicated with the same precision we used to create it.<br><br>We hope you enjoy these new changes to Rolling Rhino Remix, and our brand.",
        
        "sections": [
        ]
    },
    {
        "id": "rhino-update-v130",
    
        "title": "rhino-update v1.3 - Quality of life",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Our upgrade utility, rhino-update has received its first major update in almost 12 days. These changes include some tweaks to improve our upgrade utility and general quality of life changes.<br><br>• A brand-new feature that ensures that the mainline Linux kernel is not installed twice. This was created to help save bandwidth if required. If users have a slower internet connection, running an upgrade can take a long while, especially if the same kernel is being reinstalled.<br>• An important bug fix that allows for Pacstall to be installed, rather than giving an error. Now users are able to install Pacstall onto their system once again.<br><br>To receive the latest updates, please run <span class='code'>rhino-update</span> to upgrade your system.",
        
        "sections": [
        ]
    },
    {
        "id": "2022-05-03",
    
        "title": "Release 2022.05.03",
    
        "date": "Unrecorded Date",
    
        "paragraph": "After two weeks of development we are now ready to release the latest packaged version of Rolling Rhino Remix!",
        
        "sections": [
            {
                "title": "What's new?",
    
                "paragraph": "• All packages are updated to their latest version in the repository.<br>• The rhino-config v2.0.1 binary is now included in the distribution.<br>• A separate ~/.bash_aliases file has been included in the distribution that will be updated whenever one of our aliases requires an update.<br>• Bug fixes.<br><br>If you are using an already existing installation of Rolling Rhino Remix then you will be able to upgrade to the latest version with <span class='code'>rhino-update</span>.<br><br>If you wish to download Rolling Rhino Remix with a fresh disk image then you can download it <a href='/download' target='_blank'>here</a>."
            }
        ]
    },
    {
        "id": "joining-oin",
    
        "title": "Ensuring software remains free - Rolling Rhino Remix has joined the Open Inventions Network",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Free software is crucial for software development. The goal of Rolling Rhino Remix is to provide a free, open-source operating system based on Ubuntu. That is why Rolling Rhino Remix has joined the <a href='https://openinventionnetwork.com/' target='_blank'>Open Inventions Network</a>. The Open Invention Network is a patent non-agression community that supports the freedom of Linux and Open Source software, and helps reduce the risks of patent risks. All members of the Open Invention Network sign the same agreement to cross license their Linux System patents royalty free. The Open Invention Network owns over 2.7 million patents & applications and all members also gain access to the Open Invention Network’s portfolio of 350 intellectual property assets.<br><br>Many companies and projects have joined the Open Invention Network, including: Canonical, Red Hat, IBM, Suse, Phillips and Microsoft. By joining the Open Invention Network we will have access to the patents they have agreed to provide to the Network, as well as giving any project and company the ability to utilise our patents.<br><br>• <a href='https://openinventionnetwork.com/' target='_blank'>Statistics and information from the Open Inventions Network website</a>",
        
        "sections": [
        ]
    },
    {
        "id": "development-update-2",
    
        "title": "Development is underway for 2022.05.03!",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Development has begun for the next disk image release. A lot of small changes are going into this release to create the best possible user experience. The newly packaged <span class='code'>rhino-config v2.0</span> binaries will be provided by default, along with a set of brand-new wallpapers. At the moment we are unsure whether the default wallpaper will change, but some alternatives will be provided in <span class='code'>/usr/share/backgrounds/rolling-backgrounds</span>. Other small changes such as the rest of the <span class='code'>config-v2</span> update that was pushed to <span class='code'>rhino-update</span> will also be provided by default, and all packages will be updated to their latest versions.<br><br>This is the first disk image that will be built on top of the released Jammy disk image, and so when you switch to the devel series with <span class='code'>rhino-init</span>, it will prompt an error similar to <span class='code'>E: expected Jammy but got Kinetic.</span>, This can be rectified by hitting “y” (for yes) to switch the devel series to track Kinetic. Your system will still be Rolling, it just means that the development branch is now tracking the upcoming Ubuntu release.<br><br>",
        
        "sections": [
        ]
    },
    {
        "id": "config-v2",
    
        "title": "rhino-config v2.0 & rhino-update v1.2.1",
    
        "date": "Unrecorded Date",
    
        "paragraph": "After a couple of weeks of development, rhino-config v2.0 has been completed. We have completely turned rhino-config into a command-line utility, written in Rust, with the help of our new maintainer, Wizard28. This means that support for the legacy python script will be dropping.<br><br>From now on, in order to be able to use <span class='code'>rhino-config</span> you must first update your system to pull the latest Rust binary from our repository. To do this, type <span class='code'>rhino-update</span> in your terminal. The full documentation for rhino-config has been updated and can be found <a href='https://github.com/rollingrhinoremix/docs/wiki/rhino-config' target='_blank'>here</a>.<br><br>• If you would still like an interactive script, similar to the way that rhino-config was in version v1.2, you can run <span class='code'>rhino-config enable --interactive</span> to have it walk you through the options.<br><br><span class='code'>rhino-update</span> has received a minor update, which will now download and install the latest rust binary for rhino-config. Along with this it now will install kernel 5.17.4 as opposed to 5.17.3. In order to ensure that updates are ran smoother, the .bashrc file will be replaced and all of our Rhino aliases will be moved to ~/.bash_aliases, so that we can update the bash aliases without any disruptive change to the system.",
        
        "sections": [
            {
                "title": "Legacy rhino-config script",
    
                "paragraph": "The legacy <span class='code'>rhino-config</span> python script will still be available until the next disk image release, so that users who have not yet ran <span class='code'>rhino-update</span> will not receive any major breaking changes. The script will officially be deprecated as of 2022.05.03, and will automatically upgrade the user if they have not done so already. it is recommended that you run <span class='code'>rhino-update</span> to receive the latest change as soon as possible."
            }
        ]
    },
    {
        "id": "rhino-v120",
    
        "title": "Pacstall integration - rhino-update & rhino-config v1.2",
    
        "date": "Unrecorded Date",
    
        "paragraph": "The Rolling Rhino Remix development team has worked closely with the development team of <a href='https://pacstall.dev/' target='_blank'>Pacstall</a> to bring their software onto our distribution. Pacstall is an AUR-inspired package manager for Ubuntu. It brings the experience of the Arch User Repository directly to Ubuntu and Ubuntu-based systems with an ever-growing number of user-maintained packages.<br><br>We have integrated, along with the help of the Pacstall development team, Pacstall directly into our Rhino utilities. Pacstall can now be enabled via <span class='code'>rhino-config</span> and all Pacstall applications can be updated via <span class='code'>rhino-update</span>.<br><br>In order to enable Pacstall onto your system please read our <a href='https://github.com/rollingrhinoremix/docs/wiki/pacstall' target='_blank'>Pacstall documentation</a>.",
        
        "sections": [
        ]
    },
    {
        "id": "2022-04-19",
    
        "title": "Release 2022.04.19 & What's to come for the future.",
    
        "date": "Unrecorded Date",
    
        "paragraph": "After almost 3 weeks of hard work we have released the latest packaged version of Rolling Rhino Remix.",
        
        "sections": [
            {
                "title": "What's new?",
    
                "paragraph": "• All packages have been updated to their latest versions in the Ubuntu repositories.<br>• The <a href='https://github.com/rollingrhinoremix/rhino-config' target='_blank'>rhino-config</a> utility has been created to extend the capabilities of <span class='code'>rhino-update</span>, it has the ability to purge and hold snapd from apt updates and install the mainline kernel.<br>• Bug fixes.<br>• Code refactoring<br><br>If you are using an already existing installation of Rolling Rhino Remix then you will be able to upgrade to the latest version with <span class='code'>rhino-update</span>.<br><br>• Before you update it is important to note that a bug in 2022.03.26 requires manual intervention to fix otherwise the upgrade to the latest release will not work. In order to fix this bug click <a href='/news#2022-03-26bug' target='_blank'>here</a>.<br><br>If you wish to download Rolling Rhino Remix with a fresh disk image then you can download it <a href='/download' target='_blank'>here</a>."
            },
            {
                "title": "The future of Rolling Rhino Remix",
    
                "paragraph": "This has been known for a while but all discussion and development for Rolling Rhino Remix now happens on our Discord, which you can join <a href='https://discord.gg/JMu4SYRs2n' target='_blank'>here</a>.<br><br>From this release onwards all of our utilities, such as rhino-config and rhino-update, will be updated irrsepective of disk image releases. Large-scale changes to the utilities will still receive updates on our blog page. This will allow for users to get the latest and greatest changes to Rhino without any wait.<br><br>We have updated our website, it now uses server-side Jekyll to generate the pages rather than Eleventy being ran client-side then the generated pages being uploaded to GitHub. This will allow for people to make web-pages and fix our mistakes easier as they will be in pure Markdown as opposed to HTML.<br><br>The biggest change for the future of Rolling Rhino Remix is the integration of <a href='https://pacstall.dev/' target='_blank'>Pacstall</a>. We have worked along-side the developers of Pacstall to integrate their software into our Distribution. Pacstall provides a similar experience to the <a href='https://aur.archlinux.org/' target='_blank'>AUR</a> on Ubuntu, and working along-side these developers to integrate it into our Distribution will mean that you will have a new way to install bleeding-edge software onto your system.<br><br>As always, thanks to everyone who has shown an interest in the project, and a special thank you to our <a href='/info' target='_blank'>developers & contributors</a> who have helped improve the project."
            }
        ]
    },
    {
        "id": "2022-03-26bug",
    
        "title": "Bug in 2022.03.26 - Requires manual intervention",
    
        "date": "Unrecorded Date",
    
        "paragraph": "During the development cycle of 2022.04.14 I have noticed a bug that will affect currently existing versions of Rolling Rhino Remix (2022.03.26 is the only version released.), the bash alias that calls <span class='code'>rhino-update</span> runs the <span class='code'>update.sh</span> script as sudo, which has presented problems when we look for files in the user’s home directories. Luckily you are able to easily manually patch the system yourself.<br><br>The fix is fairly straightforward, all you will need is <span class='code'>git</span> and <span class='code'>mv</span>, both of which are provided in Rolling Rhino Remix.<br><br>To apply the fix, do the following:<br>• <span class='code'>cd ~</span><br>• <span class='code'>git clone https://github.com/rollingrhinoremix/distro</span><br>• <span class='code'>mv ~/distro/.bashrc ~</span><br>• <span class='code'>mv ~/distro/.bash_aliases</span><br><br>...and there you go, the fix has been applied and you will continue getting updates from us. The next update, which releases with 2022.04.14, will work as intended if you have applied this patch.",
        
        "sections": [
        ]
    },
    {
        "id": "development-update-1",
    
        "title": "Development underway for 2022.04.14!",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Development has gone underway for the next packaged .iso of Rolling Rhino Remix! This release won't just be a newly compiled disk image with the latest updates. We are aiming to release a new update to the Rhino utility by the time we have released 2022.04.14. The new feature, <span class='code'>rhino-config</span> will at first only support the option to configure whether you would prefer to use the mainline Linux kernel or stick with the current Ubuntu kernel with all of their optimizations however support will be extended in the future to allow for the installation of proprietary drivers and other features too.<br><br>This release has been delayed by an extra couple of days for two various reasons:<br>• Due to conflicting schedules in personal lives we have had to delay the release, as preparing for a release takes a lot of work.<br>• We are aiming to release <span class='code'>rhino-config</span> in this release and we are determined to do it.<br><br>Other changes in this future release include:<br>• Us trialing a more automated process for .iso creation using a bash script, which will allow us more time to work on other features of the distribution, such as Rhino<br>• Having the new disk images have the latest updates so users are not required to update a lot of packages upon installation.",
        
        "sections": [
        ]
    },
    {
        "id": "2022-03-26",
    
        "title": "Release 2022.03.26",
    
        "date": "Unrecorded Date",
    
        "paragraph": "Rolling Rhino Remix has had its first official public release! Ubuntu is now (unofficially) provided as a rolling release distribution! You are able to download the .iso file for the distribution <a href='/download' target='_blank'>here</a>.<br><br>",
        
        "sections": [
            {
                "title": "What's new?",
    
                "paragraph": "• All packages have been updated to their latest versions in the Ubuntu repository.<br>• The Rhino utility tool has been created and packaged in the distribution. Rhino is used as a drop-in replacement for <span class='code'>apt update</span> and <span class='code'>apt upgrade</span> and allows for the initialization of the distribution upon first installation. To learn more please read the <a href='https://github.com/rollingrhinoremix/docs/wiki' target='_blank'>rhino documentation</a> and Quick Start guide.<br>• We have replaced the default background with our own background image featuring our mascot, a rhino! You are able to download the background image <a href='/branding' target='_blank'>here</a>.<br><br>Furthermore Rolling Rhino is now fully open source upon its first release, if you for any reason decide to create your own disk image rather than use the ones we have created, you can. Just read our documentation and follow the steps provided <a href='https://github.com/rollingrhinoremix/docs/wiki' target='_blank'>here</a>.<br><br>Thank you to all of our contributors who have made our first release possible! You are able to view the full list of contributors <a href='/info' target='_blank'>here</a>."
            }
        ]
    }
]